app/Http/Controllers/AttendanceController.php

    public function studentAttendanceSubmit(Request $request)
    {
        $check_attendance = Student_attendance::checkAlreadyAttendance($request->student_id, $request->class_id, $request->attendance_date);
        if(!empty($check_attendance))
        {
            $attendance = $check_attendance;
        }
        else
        {
            $attendance = Student_attendance::make($request->except('created_by', 'attendance_type'));
        }
        $attendance->attendance_type = $request->attendance_type;
        $attendance->created_by = Auth::user()->id;
        $attendance->save();
---
insert into `student_attendances` (`student_id`, `class_id`, `attendance_date`, `attendance_type`, `created_by`, `updated_at`, `created_at`) values ('14', '7', '2024-04-10', '2', 1, '2024-04-22 10:57:09', '2024-04-22 10:57:09')

    public function myAttendanceParent($student_id)
    {
        $data['my_student']  = User::find($student_id);
---
select * from `users` where `users`.`id` = '13' limit 1