app/Http/Controllers/CalendarController.php

    public function myStudentCalendarParent($student_id)
    {
        $getStudent = User::find($student_id);
---
select * from `users` where `users`.`id` = '24' limit 1