app/Http/Controllers/CommunicateController.php

    public function insertNoticeBoard(Request $request)
    {
        $notice = NoticeBoard::make($request->except('created_by'));
        $notice->created_by =  Auth::user()->id;
        $notice->save();
---
insert into `notice_boards` (`title`, `publish_date`, `message`, `created_by`, `updated_at`, `created_at`) values ('sdfasdds', '2024-04-08', 'dfgertgfeeeeeeeeeeeuy74fgdsgdgbfjhuyjhhhhhhhhhhh', 1, '2024-04-29 03:47:00', '2024-04-29 03:47:00')