app/Http/Controllers/ExaminationController.php

    public function submit_marks_register(Request $request)
    {
        if(!empty($request->mark))
        {
            foreach($request->mark as $mark)
            {
                $class_work = !empty($mark['class_work'])? $mark['class_work'] : 0;
                $home_work = !empty($mark['home_work'])? $mark['home_work'] : 0;
                $test_work = !empty($mark['test_work'])? $mark['test_work'] : 0;
                $exam = !empty($mark['exam'])? $mark['exam'] : 0;
                $getMark = Marks_register::checkAlreadyMark(Request('student_id') ,Request('exam_id'), Request('class_id'), $mark['subject_id']);
                if(!empty($getMark))
                {
                    $mark_register = $getMark;
                }
                else
                {
                    $mark_register = new Marks_register();
                    $mark_register->created_by = Auth::user()->id;
                }

                $mark_register->student_id = $request->student_id;
                $mark_register->exam_id = $request->exam_id;
                $mark_register->class_id = $request->class_id;
                $mark_register->subject_id = $mark['subject_id'];
                $mark_register->class_work = $class_work;
                $mark_register->home_work = $home_work;
                $mark_register->test_work = $test_work;
                $mark_register->exam = $exam;
                $mark_register->save();
---
insert into `marks_registers` (`created_by`, `student_id`, `exam_id`, `class_id`, `subject_id`, `class_work`, `home_work`, `test_work`, `exam`, `updated_at`, `created_at`) values (1, '22', '2', '6', '4', 0, 0, 0, '5', '2024-04-07 01:57:34', '2024-04-07 01:57:34')