app/Http/Controllers/ExaminationController.php

insert into `marks_grades` (`name`, `percent_from`, `percent_to`, `created_by`, `updated_at`, `created_at`) values ('emu', '71', '100', 1, '2024-04-20 01:07:33', '2024-04-20 01:07:33')
---
    public function marks_grade_insert(Request $request)
    {
        $mark = Marks_grade::make($request->except('created_by'));
        $mark->created_by = Auth::user()->id;
        $mark->save();

update `marks_grades` set `percent_from` = '71', `marks_grades`.`updated_at` = '2024-04-20 00:59:55' where `id` = 6
---
    public function marks_grade_update(Request $request, Marks_grade $marks_grade)
    {
        $marks_grade->update($request->all());

select * from `users` where `users`.`id` = '13' limit 1
---
    public function myStudentExamTimetableParent($student_id)
    {
        $getStudent = User::find($student_id);