app/Models/Assign_class_teacher.php

    static public  function getClassTeacher()
    {
        $return = self::select('assign_class_teachers.*', 'classes.name as class_name', 'teacher.name as teacher_name', 'users.name as created_by_name')
            ->join('users as teacher', 'teacher.id', 'assign_class_teachers.teacher_id')
            ->join('classes', 'classes.id', 'assign_class_teachers.classe_id')
            ->join('users', 'users.id', 'assign_class_teachers.created_by');
        if (!empty(request('teacher_name'))) {
            $teacher_name = request('teacher_name');
            $return = $return->where('teacher.name', 'like', '%' . $teacher_name . '%');
        }
        if (!empty(request('class_name'))) {
            $class_name = request('class_name');
            $return = $return->where('classes.name', 'like', '%' . $class_name . '%');
        }
        if (request()->has('status') && request('status') !== null) {
            $status = request('status');
            $return = $return->where('assign_class_teachers.status', $status);
        }

        if (!empty(request('date'))) {
            $date = request('date');
            $return = $return->whereDate('users.created_at', $date);
        }
        $return = $return->orderBy('assign_class_teachers.id', 'desc')
            ->where('assign_class_teachers.is_delete', 0)
            ->where('classes.is_delete', 0)
            ->where('classes.status', 0)
            ->paginate(4);
---
select `assign_class_teachers`.*, `classes`.`name` as `class_name`, `teacher`.`name` as `teacher_name`, `users`.`name` as `created_by_name` from `assign_class_teachers` inner join `users` as `teacher` on `teacher`.`id` = `assign_class_teachers`.`teacher_id` inner join `classes` on `classes`.`id` = `assign_class_teachers`.`classe_id` inner join `users` on `users`.`id` = `assign_class_teachers`.`created_by` where `assign_class_teachers`.`is_delete` = 0 and `classes`.`is_delete` = 0 and `classes`.`status` = 0 order by `assign_class_teachers`.`id` desc limit 4 offset 0
select count(*) as aggregate from `assign_class_teachers` inner join `users` as `teacher` on `teacher`.`id` = `assign_class_teachers`.`teacher_id` inner join `classes` on `classes`.`id` = `assign_class_teachers`.`classe_id` inner join `users` on `users`.`id` = `assign_class_teachers`.`created_by` where `assign_class_teachers`.`is_delete` = 0 and `classes`.`is_delete` = 0 and `classes`.`status` = 0

    static public function getMyClassSubjectGroup($teacher_id)
    {
        $return = self::select('assign_class_teachers.*', 'classes.name as class_name', 'classes.id as class_id')
            ->join('classes', 'classes.id', 'assign_class_teachers.classe_id')
            ->where('classes.is_delete', 0)
            ->where('classes.status', 0)
            ->where('assign_class_teachers.teacher_id', $teacher_id)
            ->where('assign_class_teachers.is_delete', 0)
            ->where('assign_class_teachers.status', 0)
            ->groupBy('assign_class_teachers.classe_id')
            ->get();
---
select `assign_class_teachers`.*, `classes`.`name` as `class_name`, `classes`.`id` as `class_id` from `assign_class_teachers` inner join `classes` on `classes`.`id` = `assign_class_teachers`.`classe_id` where `classes`.`is_delete` = 0 and `classes`.`status` = 0 and `assign_class_teachers`.`teacher_id` = 3 and `assign_class_teachers`.`is_delete` = 0 and `assign_class_teachers`.`status` = 0 group by `assign_class_teachers`.`classe_id`

    static public function getCalendarTeacher($teacher_id)
    {
        return self::select('class_subject_timetable.*', 'classes.name as class_name', 'subjects.name as subject_name', 'week.name as week_name', 'week.fullcalendar_day')
                ->join('classes', 'classes.id', 'assign_class_teachers.classe_id')
                ->join('class_subjects', 'class_subjects.classe_id', 'classes.id')
                ->join('class_subject_timetable', 'class_subject_timetable.subject_id', 'class_subjects.subject_id')
                ->join('subjects', 'subjects.id', 'class_subject_timetable.subject_id')
                ->join('week', 'week.id', 'class_subject_timetable.week_id')
                ->where('assign_class_teachers.teacher_id', $teacher_id)
                ->where('assign_class_teachers.status', 0)
                ->where('assign_class_teachers.is_delete', 0)
                ->get();
---
select `class_subject_timetable`.*, `classes`.`name` as `class_name`, `subjects`.`name` as `subject_name`, `week`.`name` as `week_name`, `week`.`fullcalendar_day` from `assign_class_teachers` inner join `classes` on `classes`.`id` = `assign_class_teachers`.`classe_id` inner join `class_subjects` on `class_subjects`.`classe_id` = `classes`.`id` inner join `class_subject_timetable` on `class_subject_timetable`.`subject_id` = `class_subjects`.`subject_id` inner join `subjects` on `subjects`.`id` = `class_subject_timetable`.`subject_id` inner join `week` on `week`.`id` = `class_subject_timetable`.`week_id` where `assign_class_teachers`.`teacher_id` = 3 and `assign_class_teachers`.`status` = 0 and `assign_class_teachers`.`is_delete` = 0