app/Models/ExamSchedulModel.php

select `exam_schedule`.*, `exam`.`name` as `exam_name` from `exam_schedule` inner join `exam` on `exam`.`id` = `exam_schedule`.`exam_id` inner join `assign_class_teachers` on `assign_class_teachers`.`classe_id` = `exam_schedule`.`class_id` where `assign_class_teachers`.`teacher_id` = 3 group by `exam_schedule`.`exam_id` order by `exam_schedule`.`id` desc
---
    static public function getExamTeacher($teacher_id)
    {
        return self::select('exam_schedule.*', 'exam.name as exam_name')
                 ->join('exam', 'exam.id', 'exam_schedule.exam_id')
                 ->join('assign_class_teachers', 'assign_class_teachers.classe_id', 'exam_schedule.class_id')
                 ->where('assign_class_teachers.teacher_id', $teacher_id)
                 ->groupBy('exam_schedule.exam_id')
                 ->orderBy('exam_schedule.id', 'desc')
                 ->get();

select `exam_schedule`.*, `subjects`.`name` as `subject_name`, `subjects`.`type` as `subject_type` from `exam_schedule` inner join `subjects` on `subjects`.`id` = `exam_schedule`.`subject_id` where `exam_schedule`.`class_id` = 4 and `exam_schedule`.`exam_id` = 2
---
    static public function getExam($class_id)
    {
        return self::select('exam_schedule.*', 'exam.name as exam_name')
                 ->join('exam', 'exam.id', 'exam_schedule.exam_id')
                 ->where('exam_schedule.class_id', $class_id)
                 ->groupBy('exam_id')
                 ->orderBy('exam_schedule.id', 'desc')
                 ->get();

select `exam_schedule`.*, `subjects`.`name` as `subject_name`, `subjects`.`type` as `subject_type` from `exam_schedule` inner join `subjects` on `subjects`.`id` = `exam_schedule`.`subject_id` where `exam_schedule`.`class_id` = '7' and `exam_schedule`.`exam_id` = '2'
---
    static public function getExamTimetable($exam_id, $class_id)
    {
        return self::select('exam_schedule.*', 'subjects.name as subject_name', 'subjects.type as subject_type')
                 ->join('subjects', 'subjects.id', 'exam_schedule.subject_id')
                 ->where('exam_schedule.class_id', $class_id)
                 ->where('exam_schedule.exam_id', $exam_id)
                 ->get();

select `exam_schedule`.*, `classes`.`name` as `class_name`, `subjects`.`name` as `subject_name`, `exam`.`name` as `exam_name` from `exam_schedule` inner join `assign_class_teachers` on `assign_class_teachers`.`classe_id` = `exam_schedule`.`class_id` inner join `classes` on `classes`.`id` = `exam_schedule`.`class_id` inner join `subjects` on `subjects`.`id` = `exam_schedule`.`subject_id` inner join `exam` on `exam`.`id` = `exam_schedule`.`exam_id` where `assign_class_teachers`.`teacher_id` = 3
---
    static public function getExamTimetableTeacher($teacher_id)
    {
        return self::select('exam_schedule.*', 'classes.name as class_name', 'subjects.name as subject_name', 'exam.name as exam_name')
                ->join('assign_class_teachers', 'assign_class_teachers.classe_id', 'exam_schedule.class_id')
                ->join('classes', 'classes.id', 'exam_schedule.class_id')
                ->join('subjects', 'subjects.id', 'exam_schedule.subject_id')
                ->join('exam', 'exam.id', 'exam_schedule.exam_id')
                ->where('assign_class_teachers.teacher_id', $teacher_id)
                ->get();