app/Models/Marks_register.php

    static public function checkAlreadyMark($student_id, $exam_id, $class_id, $subject_id)
    {
        return self::where('student_id', $student_id)->where('exam_id', $exam_id)->where('class_id', $class_id)->where('subject_id', $subject_id)->first();
---
select * from `marks_registers` where `student_id` = 22 and `exam_id` = '2' and `class_id` = '6' and `subject_id` = 4 limit 1

    static public function getExam($student_id)
    {
        return self::select('marks_registers.*', 'exam.name as exam_name')
                            ->join('exam', 'exam.id', 'marks_registers.exam_id')
                            ->where('marks_registers.student_id', $student_id)
                            ->groupBy('marks_registers.exam_id')
                            ->get();
---
select `marks_registers`.*, `exam`.`name` as `exam_name` from `marks_registers` inner join `exam` on `exam`.`id` = `marks_registers`.`exam_id` where `marks_registers`.`student_id` = 13 group by `marks_registers`.`exam_id`

    static public function getExamSubject($exam_id ,$student_id)
    {
        return self::select('marks_registers.*', 'exam.name as exam_name', 'subjects.name as subject_name')
                            ->join('exam', 'exam.id', 'marks_registers.exam_id')
                            ->join('subjects', 'subjects.id', 'marks_registers.subject_id')
                            ->where('marks_registers.exam_id', $exam_id)
                            ->where('marks_registers.student_id', $student_id)
                            ->get();
---
select `marks_registers`.*, `exam`.`name` as `exam_name`, `subjects`.`name` as `subject_name` from `marks_registers` inner join `exam` on `exam`.`id` = `marks_registers`.`exam_id` inner join `subjects` on `subjects`.`id` = `marks_registers`.`subject_id` where `marks_registers`.`exam_id` = 1 and `marks_registers`.`student_id` = 13