app/Models/Marks_grade.php

select `marks_grades`.*, `users`.`name` as `created_name` from `marks_grades` inner join `users` on `users`.`id` = `marks_grades`.`created_by`
---
    static public function getRecord()
    {
        return self::select('marks_grades.*', 'users.name as created_name')
                    ->join('users', 'users.id', 'marks_grades.created_by')
                    ->get();

select `marks_grades`.* from `marks_grades` where `percent_from` <= 90 and `percent_to` >= 90 limit 1
---
    static public function getGrade($percent)
    {
        $return = self::select('marks_grades.*')
                        ->where('percent_from', '<=', $percent)
                        ->where('percent_to', '>=', $percent)
                        ->first();