app/Models/Student_attendance.php

    static public function getAtttendance()
    {
        $return = self::select('student_attendances.*', 'classes.name as class_name', 'student.name as student_name', 'student.last_name as student_last_name', 'createdby.name as created_name')
            ->join('classes', 'classes.id', 'student_attendances.class_id')
            ->join('users as student', 'student.id', 'student_attendances.student_id')
            ->join('users as createdby', 'createdby.id', 'student_attendances.created_by');

        if (!empty(Request('class_id'))) {
            $return = $return->where('student_attendances.class_id', Request('class_id'));
        }
        if (!empty(Request('student_id'))) {
            $return = $return->where('student_attendances.student_id', Request('student_id'));
        }
        if (!empty(Request('attendance_date'))) {
            $return = $return->where('student_attendances.attendance_date', Request('attendance_date'));
        }
        if (!empty(Request('attendance_type'))) {
            $return = $return->where('student_attendances.attendance_type', Request('attendance_type'));
        }
        return $return->orderBy('student_attendances.id', 'desc')
            ->paginate(2);
---
select count(*) as aggregate from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by`
select `student_attendances`.*, `classes`.`name` as `class_name`, `student`.`name` as `student_name`, `student`.`last_name` as `student_last_name`, `createdby`.`name` as `created_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` order by `student_attendances`.`id` desc limit 2 offset 0