app/Models/Student_attendance.php

select * from `student_attendances` where `student_id` = 22 and `class_id` = '6' and date(`attendance_date`) = '2024-04-10' limit 1
---
    static public function checkAlreadyAttendance($student_id, $class_id, $attendance_date)
    {
        return self::where('student_id', $student_id)->where('class_id', $class_id)->whereDate('attendance_date', $attendance_date)->first();

select `student_attendances`.*, `classes`.`name` as `class_name`, `student`.`name` as `student_name`, `student`.`last_name` as `student_last_name`, `createdby`.`name` as `created_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` order by `student_attendances`.`id` desc limit 50 offset 0
select `student_attendances`.*, `classes`.`name` as `class_name`, `student`.`name` as `student_name`, `student`.`last_name` as `student_last_name`, `createdby`.`name` as `created_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` where `student_attendances`.`class_id` = '6' order by `student_attendances`.`id` desc limit 50 offset 0
select `student_attendances`.*, `classes`.`name` as `class_name`, `student`.`name` as `student_name`, `student`.`last_name` as `student_last_name`, `createdby`.`name` as `created_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` where `student_attendances`.`attendance_date` >= '2024-04-08' and `student_attendances`.`attendance_date` <= '2024-04-12' order by `student_attendances`.`id` desc limit 2 offset 0
select `student_attendances`.*, `classes`.`name` as `class_name`, `student`.`name` as `student_name`, `student`.`last_name` as `student_last_name`, `createdby`.`name` as `created_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` where `student_attendances`.`class_id` = '6' and `student_attendances`.`attendance_date` = '2024-04-11' and `student_attendances`.`attendance_type` = '3' and `student_attendances`.`attendance_type` = '3' order by `student_attendances`.`id` desc limit 50 offset 0
select count(*) as aggregate from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` where `student_attendances`.`attendance_date` >= '2024-04-08' and `student_attendances`.`attendance_date` <= '2024-04-12'
---
    static public function getAtttendance()
    {
        $return = self::select('student_attendances.*', 'classes.name as class_name', 'student.name as student_name', 'student.last_name as student_last_name', 'createdby.name as created_name')
            ->join('classes', 'classes.id', 'student_attendances.class_id')
            ->join('users as student', 'student.id', 'student_attendances.student_id')
            ->join('users as createdby', 'createdby.id', 'student_attendances.created_by');

        if (!empty(Request('class_id'))) {
            $return = $return->where('student_attendances.class_id', Request('class_id'));
        }
        if (!empty(Request('student_id'))) {
            $return = $return->where('student_attendances.student_id', Request('student_id'));
        }
        if (!empty(Request('student_name'))) {
            $return = $return->where('student.name', Request('student_name'));
        }
        if (!empty(Request('start_attendance_date'))) {
            $return = $return->where('student_attendances.attendance_date','>=', Request('start_attendance_date'));
        }
        if (!empty(Request('end_attendance_date'))) {
            $return = $return->where('student_attendances.attendance_date','<=', Request('end_attendance_date'));
        }
        if (!empty(Request('attendance_type'))) {
            $return = $return->where('student_attendances.attendance_type', Request('attendance_type'));
        }
        return $return->orderBy('student_attendances.id', 'desc')
            ->paginate(5);

select `student_attendances`.*, `classes`.`name` as `class_name`, `student`.`name` as `student_name`, `student`.`last_name` as `student_last_name`, `createdby`.`name` as `created_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` where `student_attendances`.`class_id` in (7, 2, 6) order by `student_attendances`.`id` desc limit 2 offset 0
select `student_attendances`.*, `classes`.`name` as `class_name`, `student`.`name` as `student_name`, `student`.`last_name` as `student_last_name`, `createdby`.`name` as `created_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` where `student_attendances`.`class_id` in (7, 2, 6) and `student_attendances`.`class_id` = '6' and `student_attendances`.`attendance_date` = '2024-04-10' order by `student_attendances`.`id` desc limit 2 offset 0
select `student_attendances`.*, `classes`.`name` as `class_name`, `student`.`name` as `student_name`, `student`.`last_name` as `student_last_name`, `createdby`.`name` as `created_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` where `student_attendances`.`class_id` in (7, 2, 6) and `student_attendances`.`attendance_date` <= '2024-04-12' order by `student_attendances`.`id` desc limit 5 offset 0
select count(*) as aggregate from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` inner join `users` as `student` on `student`.`id` = `student_attendances`.`student_id` inner join `users` as `createdby` on `createdby`.`id` = `student_attendances`.`created_by` where `student_attendances`.`class_id` in (7, 2, 6) and `student_attendances`.`attendance_date` <= '2024-04-12'
---
    static public function studentAtttendancesTeacher($class_ids)
    {
        if (!empty($class_ids)) {
            $return = self::select('student_attendances.*', 'classes.name as class_name', 'student.name as student_name', 'student.last_name as student_last_name', 'createdby.name as created_name')
                ->join('classes', 'classes.id', 'student_attendances.class_id')
                ->join('users as student', 'student.id', 'student_attendances.student_id')
                ->join('users as createdby', 'createdby.id', 'student_attendances.created_by')
                ->whereIn('student_attendances.class_id', $class_ids);
            if (!empty(Request('class_id'))) {
                $return = $return->where('student_attendances.class_id', Request('class_id'));
            }
            if (!empty(Request('start_attendance_date'))) {
                $return = $return->where('student_attendances.attendance_date','>=', Request('start_attendance_date'));
            }
            if (!empty(Request('end_attendance_date'))) {
                $return = $return->where('student_attendances.attendance_date','<=', Request('end_attendance_date'));
            }
            if (!empty(Request('attendance_date'))) {
                $return = $return->where('student_attendances.attendance_date', Request('attendance_date'));
            }
            return $return->orderBy('student_attendances.id', 'desc')
                ->paginate(5);

select `student_attendances`.*, `classes`.`name` as `class_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` where `student_attendances`.`class_id` = 6 order by `student_attendances`.`id` desc
select `student_attendances`.*, `classes`.`name` as `class_name` from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` where `student_attendances`.`student_id` = 13 and `student_attendances`.`attendance_date` >= '2024-04-08' and `student_attendances`.`attendance_date` <= '2024-04-12' order by `student_attendances`.`id` desc limit 5 offset 0
select count(*) as aggregate from `student_attendances` inner join `classes` on `classes`.`id` = `student_attendances`.`class_id` where `student_attendances`.`student_id` = 13 and `student_attendances`.`attendance_date` >= '2024-04-08' and `student_attendances`.`attendance_date` <= '2024-04-12'
---
    static public function myAttendance($student_id)
    {
        $return = self::select('student_attendances.*', 'classes.name as class_name')
                    ->join('classes', 'classes.id', 'student_attendances.class_id' )
                    ->where('student_attendances.student_id', $student_id);
                    if (!empty(Request('class_id'))) {
                        $return = $return->where('student_attendances.class_id', Request('class_id'));
                    }
                    if (!empty(Request('start_attendance_date'))) {
                        $return = $return->where('student_attendances.attendance_date','>=', Request('start_attendance_date'));
                    }
                    if (!empty(Request('end_attendance_date'))) {
                        $return = $return->where('student_attendances.attendance_date','<=', Request('end_attendance_date'));
                    }
                    if (!empty(Request('attendance_type'))) {
                        $return = $return->where('student_attendances.attendance_type', Request('attendance_type'));
                    }
                    return $return->orderBy('student_attendances.id', 'desc')
                        ->paginate(5);