app/Models/User.php

    static public function getAdmin()
    {
        $return = self::select('users.*')
            ->where('user_type', 1)
            ->where('is_delete', 0);
        if (!empty(request('email'))) {
            $email = request('email');
            $return = $return->where('email', 'like', '%' . $email . '%');
        }
        if (!empty(request('name'))) {
            $name = request('name');
            $return = $return->where('name', 'like', '%' . $name . '%');
        }
        if (!empty(request('date'))) {
            $date = request('date');
            $return = $return->whereDate('created_at', $date);
        }
        $return  = $return->orderBy('id', 'desc')
            ->paginate(20);
---
select `users`.* from `users` where `user_type` = 1 and `is_delete` = 0 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `users` where `user_type` = 1 and `is_delete` = 0

    static public function getStudentClass($class_id)
    {
           return self::select('users.id', 'users.name', 'users.last_name')
                    ->where('users.user_type', 3)
                    ->where('users.is_delete', 0)
                    ->where('users.classe_id', $class_id)
                    ->orderBy('users.id', 'desc')
                    ->get();
---
select `users`.`id`, `users`.`name`, `users`.`last_name` from `users` where `users`.`user_type` = 3 and `users`.`is_delete` = 0 and `users`.`classe_id` = '6' order by `users`.`id` desc

    static public function getTeacherStudent($teacher_id)
    {
        $return = self::select('users.*', 'classes.name as class_name')
            ->join('classes', 'classes.id', 'users.classe_id')
            ->join('assign_class_teachers', 'assign_class_teachers.classe_id', 'classes.id')
            ->where('assign_class_teachers.teacher_id', $teacher_id)
            ->where('users.user_type', 3)
            ->where('users.is_delete', 0)
            ->where('users.status', 0)
            ->where('classes.is_delete', 0)
            ->where('classes.status', 0)
            ->orderBy('users.id', 'desc')
            ->groupBy('users.id')
            ->paginate(20);
---
select count(*) as aggregate from (select `users`.*, `classes`.`name` as `class_name` from `users` inner join `classes` on `classes`.`id` = `users`.`classe_id` inner join `assign_class_teachers` on `assign_class_teachers`.`classe_id` = `classes`.`id` where `assign_class_teachers`.`teacher_id` = 3 and `users`.`user_type` = 3 and `users`.`is_delete` = 0 and `users`.`status` = 0 and `classes`.`is_delete` = 0 and `classes`.`status` = 0 group by `users`.`id`) as `aggregate_table`
select `users`.*, `classes`.`name` as `class_name` from `users` inner join `classes` on `classes`.`id` = `users`.`classe_id` inner join `assign_class_teachers` on `assign_class_teachers`.`classe_id` = `classes`.`id` where `assign_class_teachers`.`teacher_id` = 3 and `users`.`user_type` = 3 and `users`.`is_delete` = 0 and `users`.`status` = 0 and `classes`.`is_delete` = 0 and `classes`.`status` = 0 group by `users`.`id` order by `users`.`id` desc limit 20 offset 0

    static public function getParentStudent($parent_id)
    {
        $return = self::select('users.*', 'classes.name as class_name', 'parent.name as parent_name')
        ->leftjoin('users as parent', 'parent.id', '=', 'users.parent_id')
        ->join('classes', 'classes.id', 'users.classe_id')
        ->where('users.user_type', 3)
        ->where('users.parent_id', $parent_id)
        ->where('users.is_delete', 0)
        ->orderBy('users.id', 'desc')
        ->limit(50)->get();
---
select `users`.*, `classes`.`name` as `class_name`, `parent`.`name` as `parent_name` from `users` left join `users` as `parent` on `parent`.`id` = `users`.`parent_id` inner join `classes` on `classes`.`id` = `users`.`classe_id` where `users`.`user_type` = 3 and `users`.`parent_id` = 9 and `users`.`is_delete` = 0 order by `users`.`id` desc limit 50

    static public  function getSingle($id)
    {
        return self::where('id', $id)->where('is_delete', 0)->first();
---
select * from `users` where `id` = '24' and `is_delete` = 0 limit 1